ЛИС2/src/InformationRegisters/лис_ЖурналОпределенияКомпонентовВПочве/лис_ЖурналОпределенияКомпонентовВПочве.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>лис_ЖурналОпределенияКомпонентовВПочве</name>
  <resources>
    <name>ДатаАнализа</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемПробы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </resources>
  <resources>
    <name>Методика</name>
    <type>
      <types>CatalogRef.МетодикиОпределенияИзмеренияАнализа</types>
    </type>
  </resources>
  <resources>
    <name>МассаНавески</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоэффициентПоправки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаПустойЧашки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаЧашкиСОстатком</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассоваяДоляПлотногоОстатка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОптическаяПлотность1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОптическаяПлотность2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОптическаяПлотность3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОптическаяПлотность4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОптическаяПлотностьСреднее</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СодержаниеГумуса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассоваяДоляОрганическогоВещества</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СодержаниеПоРасчету</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Погрешность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РазбЭкстрактаК</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.лис_ЖурналОпределенияКомпонентовВПочве</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АктОтбора</name>
    <type>
      <types>DocumentRef.лис_АктОтбораПроб</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТочкаОтбораПробы</name>
    <type>
      <types>CatalogRef.ТочкиКонтроля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОпределяемыйПоказатель</name>
    <type>
      <types>CatalogRef.КонтролируемыеПараметрыВПочвеДонныхОтложениях</types>
      <types>CatalogRef.ЗВВода</types>
      <types>CatalogRef.КонтролируемыеПоказателиВВоде</types>
      <types>CatalogRef.ФакторыФизическогоВоздействия</types>
      <types>CatalogRef.ЗВАтмосфера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШифрПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЛИС2/src/Catalogs/МетодикиОпределенияИзмеренияАнализа/МетодикиОпределенияИзмеренияАнализа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МетодикиОпределенияИзмеренияАнализа</name>
  <attributes>
    <name>Индекс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодАнализа</name>
    <type>
      <types>CatalogRef.лис_МетодыАнализа</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеМетодики</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Издание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>EnumRef.ПоказателиМетодик</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкруглениеРезультатовИзмерений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОкругленияИзмерений</name>
    <type>
      <types>EnumRef.ВариантыОкругленияИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураВоздухаОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураВоздухаДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтносительнаяВлажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НапряжениеВСети</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НапряжениеВСетиПогрешность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтборОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МатериалЕмкости</name>
    <type>
      <types>CatalogRef.МатериалыЕмкости</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтбора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемАликвоты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокХраненияПробы</name>
    <type>
      <types>CatalogRef.СрокиХраненияПробы</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособКонсервации</name>
    <type>
      <types>CatalogRef.СпособыКонсервации</types>
    </type>
  </attributes>
  <attributes>
    <name>КонсервацияОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокХраненияКонсервированнойПробы</name>
    <type>
      <types>CatalogRef.СрокиХраненияПробы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоказателиФормулы</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДиапазоныИзмерений</name>
    <attributes>
      <name>МетрологическаяХарактеристика</name>
      <type>
        <types>CatalogRef.МетрологическиеХарактеристики</types>
      </type>
    </attributes>
    <attributes>
      <name>ДиапазонИзмеренийОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДиапазонИзмеренийДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>Формула</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательПовторяемости</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательВоспроизводимости</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательТочности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательПравильности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Формулы</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Формула</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КачественныеПоказатели</name>
    <attributes>
      <name>МетрологическаяХарактеристика</name>
      <type>
        <types>CatalogRef.МетрологическиеХарактеристики</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЛИС2/src/InformationRegisters/лис_ЖурналОпределенияКомпонентовВПочве/Forms/ФормаЗаписи/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВычислитьЗначениеФормулыНаСервере()
	
	Возврат Справочники.МетодикиОпределенияИзмеренияАнализа.ВычислитьЗначениеФормулы(Запись.Методика, ПоказателиФормулы.Выгрузить());	
		
КонецФункции

&НаСервере
Процедура ЗаполнитьПоказателиФормулы()
	
	ПоказателиФормулы.Загрузить(Запись.Методика.ПоказателиФормулы.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияПоказателейФормулы()
	
	НаборЗаписей = РегистрыСведений.лис_ПоказателиРасчетовСодержанияКомпонентов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Запись.Документ);
	НаборЗаписей.Отбор.АктОтбора.Установить(Запись.АктОтбора);
    НаборЗаписей.Отбор.ТочкаОтбораПробы.Установить(Запись.ТочкаОтбораПробы);
    НаборЗаписей.Отбор.ОпределяемыйПоказатель.Установить(Запись.ОпределяемыйПоказатель);
    НаборЗаписей.Отбор.ШифрПробы.Установить(Запись.ШифрПробы);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		
		Для каждого Строка из НаборЗаписей Цикл 
			Отбор = новый Структура("Показатель", Строка.Показатель);
			НайденныеСтроки = ПоказателиФормулы.НайтиСтроки(Отбор);
			Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
				НайденнаяСтрока.Значение = Строка.Значение;
			КонецЦикла;
		КонецЦикла;
		
	Иначе   
		
		Для каждого СтрокаТаблицы из ПоказателиФормулы Цикл
			Если СтрокаТаблицы.Показатель = "V" Тогда
				СтрокаТаблицы.Значение = Запись.ОбъемПробы;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Функция РасчитатьСреднююОптическуюПлотность()
	
	Запись.ОптическаяПлотностьСреднее = (Запись.ОптическаяПлотность1 + Запись.ОптическаяПлотность2 + Запись.ОптическаяПлотность3 + Запись.ОптическаяПлотность4) / 4;
	
КонецФункции

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ЗаполнитьПоказателиФормулы();

	ЗаполнитьЗначенияПоказателейФормулы();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	НаборЗаписей = РегистрыСведений.лис_ПоказателиРасчетовСодержанияКомпонентов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Запись.Документ);
	НаборЗаписей.Отбор.АктОтбора.Установить(Запись.АктОтбора);
    НаборЗаписей.Отбор.ТочкаОтбораПробы.Установить(Запись.ТочкаОтбораПробы);
    НаборЗаписей.Отбор.ОпределяемыйПоказатель.Установить(Запись.ОпределяемыйПоказатель);
    НаборЗаписей.Отбор.ШифрПробы.Установить(Запись.ШифрПробы);
	
	Для каждого СтрокаТаблицы из ПоказателиФормулы Цикл
		НС = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Запись);
		ЗаполнитьЗначенияСвойств(НС, СтрокаТаблицы); 
	КонецЦикла;
	
	НаборЗаписей.Записать();

КонецПроцедуры


&НаКлиенте
Процедура ОбъемПробыПриИзменении(Элемент)

	Для каждого СтрокаТаблицы из ПоказателиФормулы Цикл
		Если СтрокаТаблицы.Показатель = "V" Тогда
			СтрокаТаблицы.Значение = Запись.ОбъемПробы;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОптическаяПлотность1ПриИзменении(Элемент)

	РасчитатьСреднююОптическуюПлотность();
	
КонецПроцедуры

&НаКлиенте
Процедура ОптическаяПлотность2ПриИзменении(Элемент)

	РасчитатьСреднююОптическуюПлотность();
	
КонецПроцедуры

&НаКлиенте
Процедура ОптическаяПлотность3ПриИзменении(Элемент)

	РасчитатьСреднююОптическуюПлотность();
	
КонецПроцедуры

&НаКлиенте
Процедура ОптическаяПлотность4ПриИзменении(Элемент)

	РасчитатьСреднююОптическуюПлотность();
	
КонецПроцедуры


&НаКлиенте
Процедура МетодикаПриИзменении(Элемент)

	ЗаполнитьПоказателиФормулы();
	
	ЗаполнитьЗначенияПоказателейФормулы();
	
КонецПроцедуры


&НаКлиенте
Процедура ВычислитьЗначениеФормулы(Команда)
	
	ЕстьОшибкиЗаполнения = Ложь;
	
	Если не ЗначениеЗаполнено(Запись.Методика) Тогда
		ТекстСообщения = НСтр("ru = 'Не заполнена методика.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Методика", "Запись", ЕстьОшибкиЗаполнения);
	КонецЕсли;
	
	Для Счетчик = 0 по ПоказателиФормулы.Количество()-1 Цикл
		Если не ЗначениеЗаполнено(ПоказателиФормулы[Счетчик].Значение) Тогда
			ТекстСообщения = НСтр("ru = 'Не заполнено значение показателя.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ПоказателиФормулы[" + Счетчик + "].Значение", , ЕстьОшибкиЗаполнения);
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьОшибкиЗаполнения Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеФормулы = ВычислитьЗначениеФормулыНаСервере();
	
	Если ЗначениеФормулы = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Не удалось вычислить значение по формуле.'");
		ПоказатьПредупреждение( , ТекстСообщения);
	КонецЕсли;
	
	Запись.СодержаниеПоРасчету = ЗначениеФормулы;

КонецПроцедуры

#КонецОбласти
